export default [
  {
    id: 'q1',
    text: 'ระยะห่างระหว่างโลกกับดวงจันทร์มีระยะทางประมาณกี่กิโลเมตร?',
    answers: [
      'ระยะห่างจากโลกประมาณ 384,403 กิโลเมตร',
      'ระยะห่างจากโลกประมาณ 184,403 กิโลเมตร',
      'ระยะห่างจากโลกประมาณ 284,403 กิโลเมตร',
      'ระยะห่างจากโลกประมาณ 484,403 กิโลเมตร',
    ],
  },
  {
    id: 'q2',
    text: 'React hooks มีจุดประสงค์อะไร?',
    answers: [
      'การเปิดใช้งาน State และคุณสมบัติอื่นของ React ฟีเจอร์ใน Function Component',
      'การสร้างเลย์เอาต์แบบ Responsive ในแอปพลิเคชัน React',
      'การจัดการข้อผิดพลาดภายในแอปพลิเคชัน',
      'ส่วนหนึ่งของไลบรารี Redux สำหรับการจัดการ Global state',
    ],
  },
  {
    id: 'q3',
    text: 'Chat GPT เป็นผลิตภัณฑ์ของบริษัทอะไร?',
    answers: [
      'Open AI',
      'Microsoft',
      'Google',
      'Facebook',
    ],
  },
  {
    id: 'q4',
    text: 'ภาษาอังกฤษมีตัวอักษรทั้งหมดกี่ตัว?',
    answers: [
      '26 ตัว',
      '25 ตัว',
      '27 ตัว',
      '28 ตัว',
    ],
  },
  {
    id: 'q5',
    text: '"React State" หมายถึงอะไร?',
    answers: [
      'Object ใน Component ที่ใช้เก็บค่าและอาจจะทำให้ Component มีการ Render เมื่อค่านั้นถูกเปลี่ยนแปลง',
      'Life Cycle ที่อยู่ใน React Component',
      'สถานะโดยรวมของ React Application รวมถึง Props และ Component ทั้งหมด',
      'ไลบรารีสำหรับจัดการ Global State ใน Application',
    ],
  },
  {
    id: 'q6',
    text: 'หนังเรื่อง American History X เป็นเนื้อเรื่องเกี่ยวกับอะไร?',
    answers: [
      'ประวัติศาสตร์การเหยียดผิวและความรุนแรงที่เกิดขึ้นในประเทศอเมริกา',
      'ประวัติศาสตร์การล่มสลายการเงินของประเทศอเมริกา',
      'ประวัติศาสตร์หนังสำหรับผู้ใหญ่ในประเทศอเมริกา',
      'ประวัติศาสตร์การเกิดขึ้นของประเทศอเมริกา',
    ],
  },
  {
    id: 'q7',
    text: 'วิธีใดที่ไม่สามารถใช้เพื่อ Render Content แบบมีเงื่อนไข บน React ได้?',
    answers: [
      'ใช้ #if template syntax.',
      'ใช้ ternary operator.',
      'ใช้ && operator.',
      'ใช้ if-else statement.',
    ],
  },
];
